In [10]:
%matplotlib inline
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import os
import statistics
import datetime

In [4]:
city_data_path = os.path.join('Resources','city_data.csv')
ride_data_path = os.path.join('Resources','ride_data.csv')

In [5]:
city_data_df = pd.read_csv(city_data_path)
ride_data_df = pd.read_csv(ride_data_path)

In [9]:
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [12]:
ride_data_df.tail()

                 city                 date   fare        ride_id
2370      Michaelberg  2019-04-29 17:04:39  13.38  8550365057598
2371  Lake Latoyabury  2019-01-30 00:05:47  20.76  9018727594352
2372      North Jaime  2019-02-10 21:03:50  11.11  2781339863778
2373     West Heather  2019-05-07 19:22:15  44.94  4256853490277
2374       Newtonview  2019-04-25 10:20:13  55.84  9990581345298

In [13]:
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [14]:
city_data_df.tail()

                city  driver_count   type
115     Bradshawfurt             7  Rural
116     New Ryantown             2  Rural
117   Randallchester             9  Rural
118      Jessicaport             1  Rural
119  South Saramouth             7  Rural